# ReferenceArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArrayIterator Class
Members See Also
---
An iterator to a reference array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ReferenceArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class ReferenceArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class ReferenceArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ReferenceArrayIterator
# See Also
ReferenceArrayIterator Members
Autodesk.Revit.DB Namespace